{"backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "activity_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "activation": "relu", "kernel_constraint": null, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "name": "conv2d_1"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "filters": 32, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "padding": "valid", "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "units": 128, "trainable": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_constraint": null, "units": 1, "trainable": true, "bias_constraint": null}}]}