{"config": [{"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 64, 64, 3], "name": "conv2d_9", "data_format": "channels_last", "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "dtype": "float32", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_9"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_10", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_10"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_5", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 128, "name": "dense_9", "trainable": true, "bias_constraint": null, "use_bias": true, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "name": "dense_10", "trainable": true, "bias_constraint": null, "use_bias": true, "activation": "sigmoid", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow"}